In [1]:
import pandas as pd
treino = pd.read_csv('titanic_dataset.csv')
treino

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
from ydata_profiling import ProfileReport

In [7]:
profile = ProfileReport(treino, title='titanictreino')

In [8]:
profile.to_file('yourreport.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [9]:
treino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
treino.dtypes.value_counts()

int64      5
object     5
float64    2
Name: count, dtype: int64

In [11]:
treino.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [12]:
teste = pd.read_csv('titanic_test.csv')
teste

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
413,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [14]:
teste.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Name      418 non-null    object
 2   Sex       418 non-null    object
 3   Age       332 non-null    float64
 4   SibSp     418 non-null    int64
 5   Parch     418 non-null    int64
 6   Ticket    418 non-null    object
 7   Fare      417 non-null    float64
 8   Cabin     91 non-null     object
 9   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 32.8+ KB

In [15]:
teste.isnull().sum().sort_values(ascending=False)

Cabin       327
Age          86
Fare          1
Pclass        0
Name          0
Sex           0
SibSp         0
Parch         0
Ticket        0
Embarked      0
dtype: int64

In [16]:
treino.isnull().sum().sort_values(ascending=False)

Cabin          687
Age            177
Embarked         2
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
dtype: int64

In [17]:
treino.shape

(891, 12)

In [18]:
#verificando a cardinalidade dos valores
treino.nunique().sort_values(ascending=False)

PassengerId    891
Name           891
Ticket         681
Fare           248
Cabin          147
Age             88
SibSp            7
Parch            7
Pclass           3
Embarked         3
Survived         2
Sex              2
dtype: int64

In [19]:
#eliminando colunas com alta cardinalidade
treino = pd.read_csv('titanic_dataset.csv')
treino = treino.drop(['Name', 'Ticket', 'Cabin'],axis=1)
treino

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,male,22.0,1,0,7.2500,S
1,2,1,1,female,38.0,1,0,71.2833,C
2,3,1,3,female,26.0,0,0,7.9250,S
3,4,1,1,female,35.0,1,0,53.1000,S
4,5,0,3,male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,887,0,2,male,27.0,0,0,13.0000,S
887,888,1,1,female,19.0,0,0,30.0000,S
888,889,0,3,female,NaN,1,2,23.4500,S
889,890,1,1,male,26.0,0,0,30.0000,C
890,891,0,3,male,32.0,0,0,7.7500,Q

In [20]:
teste = pd.read_csv('titanic_test.csv')
teste = teste.drop(['Name', 'Ticket', 'Cabin'],axis=1)
teste

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male   NaN      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male   NaN      0      0    8.0500        S
417       3    male   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [21]:
#media de idades para a base de treino
treino.Age.mean()

29.69911764705882

In [22]:
teste.Age.mean()

30.272590361445783

In [23]:
#selecionar as colunas com idade vazia e substituir por essa média
treino.loc[treino.Age.isnull(), 'Age'] = treino.Age.mean()

In [24]:
teste.loc[teste.Age.isnull(), 'Age'] = teste.Age.mean()

In [25]:
#verificando os valores da coluna Embarked
treino.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [26]:
treino.Embarked.mode()[0]

'S'

In [27]:
#substituindo os valores vazios
treino.loc[treino.Embarked.isnull(),'Embarked'] = treino.Embarked.mode()[0]

In [79]:
teste.loc[teste.Fare.isnull(), 'Fare'] = teste.Fare.mean()

In [29]:
#verificando novamente os valores vazios
treino.isnull().sum().sort_values(ascending=False)

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [80]:
teste.isnull().sum().sort_values(ascending=False)

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [31]:
#verificando as colunas de texto
treino.columns[treino.dtypes != 'object']

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [32]:
#selecionando apenas os valores numéricos da base de treino
treinonum = treino.loc[:,treino.columns[treino.dtypes != 'object']]

In [78]:
colteste = teste.columns[teste.dtypes != 'object']

In [76]:
testenum = teste.loc[:, colteste]

In [35]:
#Selecionar um modelo para classificar esses dados
#Árvore de classificação
#Classificação dos valores mais próximos
#Regressão logística

In [36]:
#importando o train_test_split
from sklearn.model_selection import train_test_split

In [37]:
#separando a base de treino em x e y
x = treinonum.drop(['PassengerId', 'Survived'], axis=1)
y = treino.Survived

In [38]:
#separando em treino e validação
xtreino, xval, ytreino, yval = train_test_split(x, y, test_size=0.33, random_state=42)

In [39]:
#ÁRVORE DE CLASSIFICAÇÃO
from sklearn import tree

In [40]:
clfac = tree.DecisionTreeClassifier(random_state=42)
clfac = clfac.fit(xtreino, ytreino)

In [41]:
ypredac = clfac.predict(xval)

In [42]:
#KNEIGHBORS CLASSIFIER

In [43]:
from sklearn.neighbors import KNeighborsClassifier
import numpy as np

In [44]:
clfknn = KNeighborsClassifier(n_neighbors=3)

In [45]:
clfknn = clfknn.fit(xtreino, ytreino)

In [46]:
ypredknn = clfknn.predict(xval)

In [47]:
#REGRESSÃO LOGÍSTICA

In [48]:
from sklearn.linear_model import LogisticRegression

In [49]:
clfrl = LogisticRegression(random_state=42)

In [50]:
clfrl = clfrl.fit(xtreino, ytreino)

In [51]:
ypredrl = clfrl.predict(xval)

In [52]:
#AVALIANDO ACURÁCIA E MATRIZ DE CONFUSÃO DOS MODELOS

In [53]:
from sklearn.metrics import accuracy_score

In [54]:
#para a árvore
accuracy_score(yval, ypredac)

0.6169491525423729

In [55]:
#para o knn
accuracy_score(yval, ypredknn)

0.6542372881355932

In [56]:
#para a rl
accuracy_score(yval, ypredrl)

0.7254237288135593

In [57]:
#MATRIZ DE CONFUSÃO
from sklearn.metrics import confusion_matrix

In [58]:
#árvore
confusion_matrix(yval, ypredac)

array([[125,  50],
       [ 63,  57]], dtype=int64)

In [59]:
#knn
confusion_matrix(yval, ypredknn)

array([[133,  42],
       [ 60,  60]], dtype=int64)

In [60]:
#rl
confusion_matrix(yval, ypredrl)

array([[156,  19],
       [ 62,  58]], dtype=int64)

In [61]:
#Fazendo a previsão para os dados de teste

In [71]:
xtreino

     Pclass        Age  SibSp  Parch      Fare
6         1  54.000000      0      0   51.8625
718       3  29.699118      0      0   15.5000
685       2  25.000000      1      2   41.5792
73        3  26.000000      1      0   14.4542
882       3  22.000000      0      0   10.5167
..      ...        ...    ...    ...       ...
106       3  21.000000      0      0    7.6500
270       1  29.699118      0      0   31.0000
860       3  41.000000      2      0   14.1083
435       1  14.000000      1      2  120.0000
102       1  21.000000      0      1   77.2875

[596 rows x 5 columns]

In [72]:
testenum

     Pclass       Age  SibSp  Parch      Fare
0         3  34.50000      0      0    7.8292
1         3  47.00000      1      0    7.0000
2         2  62.00000      0      0    9.6875
3         3  27.00000      0      0    8.6625
4         3  22.00000      1      1   12.2875
..      ...       ...    ...    ...       ...
413       3  30.27259      0      0    8.0500
414       1  39.00000      0      0  108.9000
415       3  38.50000      0      0    7.2500
416       3  30.27259      0      0    8.0500
417       3  30.27259      1      1   22.3583

[418 rows x 5 columns]

In [84]:
#para a base de teste ser igual à de treino, devemos eliminar a coluna Id
xteste = testenum

In [86]:
#utilizando a regressão logística na base de teste
ypred = clfrl.predict(xteste)

In [91]:
#criando uma nova coluna com a previsão na base de teste
teste['Survived'] = ypred

In [93]:
#selecionando apenas a coluna de Id e Survived para fazer o envio
baseenvio = teste[['Survived']]

In [94]:
#exportando para um csv
baseenvio.to_csv('resultados2.csv')

In [97]:
#verificando as colunas de texto na base de treino
treino.columns[treino.dtypes == 'object']

Index(['Sex', 'Embarked'], dtype='object')

In [99]:
#verificando os valores na coluna Sex
treino.Sex.value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [100]:
#na coluna Embarked
treino.Embarked.value_counts()

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [103]:
treino['MaleCheck'] = treino.Sex.apply(lambda x: 1 if x == 'male' else 0)

In [104]:
treino[['Sex', 'MaleCheck']].value_counts()

Sex     MaleCheck
male    1            577
female  0            314
Name: count, dtype: int64

In [105]:
teste['MaleCheck'] = teste.Sex.apply(lambda x: 1 if x == 'male' else 0)

In [106]:
teste[['Sex', 'MaleCheck']].value_counts()

Sex     MaleCheck
male    1            266
female  0            152
Name: count, dtype: int64

In [107]:
#tratar a coluna Embarked usando o OneHotEncoder
from sklearn.preprocessing import OneHotEncoder

In [108]:
ohe = OneHotEncoder(handle_unknown='ignore')

In [109]:
ohe = ohe.fit(treino[['Embarked']])

In [117]:
ohed = ohe.transform(treino[['Embarked']]).toarray()
ohed

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.]])

In [119]:
ohedf = pd.DataFrame(ohed, columns=ohe.get_feature_names_out())

In [120]:
ohedf.head()

   Embarked_C  Embarked_Q  Embarked_S
0         0.0         0.0         1.0
1         1.0         0.0         0.0
2         0.0         0.0         1.0
3         0.0         0.0         1.0
4         0.0         0.0         1.0

In [126]:
#adicionando essa coluna à base de treino
treino = pd.concat([treino,ohedf], axis=1)

In [129]:
treino[['Embarked', 'Embarked_C', 'Embarked_Q', 'Embarked_S']].value_counts()

ValueError: Grouper for 'Embarked_C' not 1-dimensional